#include <iostream>
#include <string>
/*
Класс Car
Определите класс Car с приватными атрибутами 
для года выпуска (year), цвета (color), 
количества дверей (count_doors), уровня топлива 
(fuel_level) и пробега (mileage).
Реализуйте конструктор для инициализации этих
атрибутов. Уровень топлива и пробег должны иметь 
значения по умолчанию 50.0 и 0.0 соответственно.

Реализуйте метод drive(double distance), 
который уменьшает уровень топлива в зависимости от 
пройденного расстояния и увеличивает пробег.
 Предположите, что автомобиль расходует 1 литр 
 топлива на 10 км.
Реализуйте метод refuel(double amount), чтобы
 добавлять топливо в бак.
Добавьте метод stop(), который выводит сообщение 
о том, что автомобиль остановлен.
Реализуйте метод info(), который выводит информацию 
об автомобиле: год выпуска, цвет, количество дверей, 
уровень топлива и пробег.

Реализуйте методы для изменения цвета 
автомобиля и получения текущих значений цвета, 
уровня топлива и пробега.

В функции main, создайте несколько объектов класса Car с разными характеристиками.
Протестируйте все методы класса, чтобы убедиться, что они работают корректно. Попробуйте пройти некоторое расстояние, заправить автомобиль, изменить его цвет и затем вывести информацию о нем.
*/
int main() {
  return 0;
}
